python/openFoamCaseEmpty/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class dictionary;
 object blockMeshDict;
}

convertToMeters 1;

vertices
  (
    (-51 -51 -6)
    (51 -51 -6)
    (51 51 -6)
    (-51 51 -6)
    (-51 -51 21)
    (51 -51 21)
    (51 51 21)
    (-51 51 21)
  );

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (103 103 28)
    simpleGrading
    (1 1 1)
  );

boundary
  (
    inlet

    {
      faces
        (

          (
            0
            4
            7
            3
          )
        );
      type patch;

    }
    outlet

    {
      faces
        (

          (
            2
            6
            5
            1
          )
        );
      type patch;

    }
    front

    {
      faces
        (

          (
            1
            5
            4
            0
          )
        );
      type wall;

    }
    back

    {
      faces
        (

          (
            3
            7
            6
            2
          )
        );
      type wall;

    }
    upperWall

    {
      faces
        (

          (
            4
            5
            6
            7
          )
        );
      type wall;

    }
    lowerWall

    {
      faces
        (

          (
            0
            3
            2
            1
          )
        );
      type wall;

    }
  ); 	// ************************************************************************* //

