python/openFoamCaseEmpty/system/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class dictionary;
 object snappyHexMeshDict;
}

castellatedMesh yes;
snap yes;
addLayers yes;
geometry
{
  combined
  {
    type triSurfaceMesh;
    file "combined.stl";
  }
  refinementBox
  {
    type searchableBox;
    min (0 0 0);
    max (1 1 1);
  }
}

castellatedMeshControls
{
  maxLocalCells 100000;
  maxGlobalCells 2000000;
  minRefinementCells 1;
  maxLoadUnbalance 0.1;
  nCellsBetweenLevels 2;
  features
    (

      {
        file "combined.eMesh";
        level 1;

      }
    );
  refinementSurfaces
  {
    combined
    {
      level
        (
          1
          1
        );
      patchInfo
      {
        type wall;
        inGroups
          (
            combinedGroup
          ); 	// Optional specification of patch type (default is wall). No// constraint types (cyclic, symmetry) etc. are allowed.
      }
    }
  }
  resolveFeatureAngle 30;
  refinementRegions
  {
    refinementBox
    {
      mode inside;
      level 1;
    }
  }
  insidePoint (0 0 19);
  allowFreeStandingZoneFaces no;
}

snapControls
{
  nSmoothPatch 1;
  tolerance 2.0;
  nSolveIter 2;
  nRelaxIter 2; 	// Feature snapping
  nFeatureSnapIter 2;
  implicitFeatureSnap no;
  explicitFeatureSnap yes;
  multiRegionFeatureSnap no;
}

addLayersControls
{
  relativeSizes yes;
  layers
  {
    "(lowerWall|combined).*"
    {
      nSurfaceLayers 1;
    }
  }
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.1;
  nGrow 0; 	// Advanced settings
  featureAngle 60;
  slipFeatureAngle 30;
  nRelaxIter 3;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 90;
  nBufferCellsNoExtrude 0;
  nLayerIter 5;
} 	// Generic mesh quality settings. At any undoable phase these determine// where to undo.

meshQualityControls
{
#include "meshQualityDict"
} 	// Advanced

mergeTolerance 1e-06; 	// ************************************************************************* //

