python/openFoamCaseEmpty/0/U.orig
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

#include "include/initialConditions"
dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform $flowVelocity;

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"
  inlet
  {

  }
  outlet
  {

  }
  front
  {

  }
  back
  {

  }
  lowerWall
  {

  }
  upperWall
  {

  }
  combinedGroup
  {

  }
}

