python/openFoamCaseEmpty/0/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volScalarField;
 object p;
}

#include "include/initialConditions"
dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $pressure;

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"
  inlet
  {

  }
  outlet
  {

  }
  lowerWall
  {

  }
  combinedGroup
  {

  }
  upperWall
  {

  }
  front
  {

  }
  back
  {

  }
} 	// ************************************************************************* //

