python/openFoamCaseEmpty/0/nut

FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    front
    {
    }
    back
    {
    }

    inlet
    {
    }

    outlet
    {
    }

    lowerWall
    {
    }

    upperWall
    {
    }

    combinedGroup
    {
    }
}


// ************************************************************************* //
